<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class AnswerSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
		DB::table("answers")->insert([
		[
			"answers" => json_encode([
				"right" => "осуществляется"
			]),
			"question_id" => 1
		],
		[
			"answers" => json_encode([
				"right" => "замкнуты"
			]),
			"question_id" => 2
		],
		[
			"answers" => json_encode([
				"right" => "направлены от севера к югу, во внутреннем- от юга к северу",
				"answers" => [
					"направлены от севера к югу, во внутреннем- от севера к югу ",
					"направлены от юга к северу, во внутреннем- от юга к северу",
					"направлены от юга к северу, во внутреннем- от севера к югу"
				]
			]),
			"question_id" => 3
		],
		[
			"answers" => json_encode([
				"right" => "правого винта"
			]),
			"question_id" => 4
		],
		[
			"answers" => json_encode([
				"right" => "правого винта",
				"answers" => [
					"левой руки",
					"Ампера",
					"правой руки"
				]
			]),
			"question_id" => 5
		],
		[
			"answers" => json_encode([
				"right" => "Ампера"
			]),
			"question_id" => 6
		],
		[
			"answers" => json_encode([
					"right" => [
						"Ампера",
						"правой руки"
					],
					"answers" => [
						"левой руки",
						"правого винта",
						"Все перечисленные"
					]
				]),
			"question_id" => 7
		],
		[
			"answers" => json_encode([
					"right" => [
						"file1" => "pole1.png",
						"file2" => "magnit2.png"
					],
					"answers" => [
						"file3" => "pole2.png",
						"file4" => "magnit1.png"
					]
				]),
			"question_id" => 8
		],
		[
			"answers" => json_encode([
					"right" => [
						"file1" => "circleToRight.gif",
						"file2" => "circleToRUp.gif"
					],
					"answers" => [
						"file3" => "circleFrom.gif",
						"file4" => "circleToleft.gif"
					]
				]),
			"question_id" => 9
		],
		[
			"answers" => json_encode([
				"right" => [
					"file4" => "rectangleRight.png"
				],
				"answers" => [
					"file1" => "rectangle1.png",
					"file2" => "rectangle2.png",
					"file3" => "rectangle3.png"
				]
			]),
			"question_id" => 10
		],
		[
			"answers" => json_encode([
				"right" => "по часовой стрелке",
				"answers" => [
					"против часовой стрелки",
					"магнитное поле не создается",
					"магнитное поле не создается"
				]
			]),
			"question_id" => 11
		],
		[
			"answers" => json_encode([
				"right" => "против часовой стрелки", 
				"answers" => [
					"по часовой стрелке",
					"магнитное поле не создается",
					"затрудняюсь ответить"
				]
			]),
			"question_id" => 12
		],
		[
			"answers" => json_encode([
				"right" => "магнитное поле не создается, так как ",
				"answers" => [
					"по часовой стрелке",
					"против часовой стрелки", 
					"магнитное поле не создается"
				]
			]),
			"question_id" => 13
		],
		[
			"answers" => json_encode([
				"right" => "ферромагнитные",
			]),
			"question_id" => 14
		],
		[
			"answers" => json_encode([
				"right" => "отталкиваются",
				"answers" => [
					"притягиваются", 
					"не взаимодействуют",
					"затрудняюсь ответить"
				]
			]),
			"question_id" => 15
		],
		[
			"answers" => json_encode([
				"right" => "притягиваются", 
				"answers" => [
					"отталкиваются",
					"не взаимодействуют",
					"затрудняюсь ответить"
				]
			]),
			"question_id" => 16
		],
		[
			"answers" => json_encode([
				"right" => "силовое воздействие на движущиеся заряды", 
				"answers" => [
					"способность изменять линейные размеры некоторых магнитных материалов при их намагничивании",
					"способность намагничивать ферромагнитные материалы",
					"способность наводить ЭДС индукции в проводнике, находящемся в переменном магнитном поле"
				]
			]),
			"question_id" => 17
		],
		[
			"answers" => json_encode([
				"right" => "сила Лоренца", 
				"answers" => [
					"сила Ампера",
					"сторонняя сила ",
					"сила Кулона",
					"ничего из перечисленного"
				]
			]),
			"question_id" => 18
		],
		[
			"answers" => json_encode([
				"right" => "явление магнитострикции", 
				"answers" => [
					"явление электромагнитной индукции",
					"явление взаимоиндукции",
					"явление самоиндукции",
					"ничего из перечисленного"
				]
			]),
			"question_id" => 19
		],
		[
			"answers" => json_encode([
				"right" => "явление электромагнитной индукции", 
				"answers" => [
					"явление взаимоиндукции",
					"явление магнитострикции",
					"явление самоиндукции",
					"ничего из перечисленного"
				]
			]),
			"question_id" => 20
		],
		[
			"answers" => json_encode([
				"right" => "явление самоиндукции",
				"answers" => [
					"явление взаимоиндукции",
					"явление магнитострикции",
					"явление электромагнитной индукции",
					"ничего из перечисленного"
				]
			]),
			"question_id" => 21
		],
		[
			"answers" => json_encode([
				"right" => "явление взаимоиндукции",
				"answers" => [
					"явление самоиндукции", 
					"явление магнитострикции",
					"явление электромагнитной индукции",
					"ничего из перечисленного"
				]
			]),
			"question_id" => 22
		],


		[
			"answers" => json_encode([
				"right" => "напряженность магнитного поля",
				"answers" => [
					"магнитный поток", 
					"индукция магнитного поля",
					"явление электромагнитной индукции",
					"потокосцепление"
				]
			]),
			"question_id" => 23
		],
		[
			"answers" => json_encode([
				"right" => "индукция магнитного поля",
				"answers" => [
					"магнитный поток", 
					"потокосцепление",
					"напряженность магнитного поля",
					"ничего из перечисленного"
				]
			]),
			"question_id" => 24
		],
		[
			"answers" => json_encode([
				"right" => "ферромагнетик",
				"answers" => [
					"диамагнетик", 
					"парамагнетик",
					"затрудняюсь ответить"
				]
			]),
			"question_id" => 25
		],
		[
			"answers" => json_encode([
				"right" => "силовая,без учета",
			]),
			"question_id" => 26
		],
		[
			"answers" => json_encode([
				"right" => "10,61",
				"answers" => [
					"5,305",
					"133,33·10^(-5)",
					"133,33·10^(-7)"
				]
			]),
			"question_id" => 27
		],
		[
			"answers" => json_encode([
				"right" => "133,33·10^(-7)",
				"answers" => [
					"5,305",
					"133,33·10^(-5)",
					"10,61",
				]
			]),
			"question_id" => 28
		],
		[
			"answers" => json_encode([
				"right" => "4,5·10^(-4)",
				"answers" => [
					"10,61",
					"133,33·10^(-7)",
					"4,5·10^(-5)",
				]
			]),
			"question_id" => 29
		],
		[
			"answers" => json_encode([
				"right" => "0,9",
				"answers" => [
					"10,61",
					"133,33·10^(-7)",
					"4,5·10^(-4)",
				]
			]),
			"question_id" => 30
		],
		[
			"answers" => json_encode([
				"head" => [
					[
						"colspan" => 1,
						"text"=> "физические величины"
					],
					[
						"colspan" => 2,
						"text"=> "формулы"
					],				
					[
						"colspan" => 2,
						"text"=> "единицы измерений физических величин"
					],
				],
				"rows" => [
					[
						"напряженность",
						1,
						"Fm/l",
						"А",
						"Вб"
					],
					[
						"потокосцепление катушки",
						2,
						"B·S",
						"Б",
						"Гн/м"
					],
					[
						"индукция",
						3,
						"μо·μ",
						"В",
						"А/м"
					],
					[
						"магнитный поток",
						4,
						"μа·H",
						"",
						""
					],
					[
						"абсолютная магнитная проницаемость среды",
						5,
						"ω·Ф",
						"",
						""
					]
				],
				"right" => [
					"1423",
					"ВААБ"
				],
				"answers" => [
					"head" => [
						[
							"colspan" => 1,
							"text"=> "напряженность"
						],
						[
							"colspan" => 1,
							"text" => "индукция"
						],
						[
							"colspan" => 1,
							"text"=> "потокосцепление катушки"
						],
						[
							"colspan" => 1,
							"text" => "абсолютная магнитная проницаемость среды"
						],
						[
							"colspan" => 1,
							"text" => "потокосцепление катушки"
						]
					],
					"answers" => [
						[
							1,
							2,
							3,
							4,
							5
						],
						[
							"А",
							"Б",
							"В"
						]
					]
				]
			]),
			"question_id" => 31
		],
		[
			"answers" => json_encode([
				"right" => "80",
				"answers" => [
					"40",
					"56",
					"72",
				]
			]),
			"question_id" => 32
		],
		[
			"answers" => json_encode([
				"right" => "0,02",
				"answers" => [
					"0,01",
					"0,005",
					"0,04",
				]
			]),
			"question_id" => 33
		],
		[
			"answers" => json_encode([
				"right" => "175",
				"answers" => [
					"100",
					"75",
					"150",
				]
			]),
			"question_id" => 34
		],

		[
			"answers" => json_encode([
				"right" => "произвольно намагниченные области в ферромагнетиках",
				"answers" => [
					"произвольно намагниченные области в диамагнетиках",
					"произвольно намагниченные области в парамагнетиках",
					"произвольно размагниченные области в парамагнетиках",
				]
			]),
			"question_id" => 35
		],
		[
			"answers" => json_encode([
				"right" => [
					"металические, применяемые в низкочастотных магнитных полях",
					"ферриты,применяемые в высокочастотных магнитных полях",
					"магнитодиэлектрики, применяемые в высокочастотных магнитных полях",
				],
				"answers" => [
					"магнитодиэлектрики, применяемые в низкочастотных магнитных полях"
				]
			]),
			"question_id" => 36
		],
		[
			"answers" => json_encode([
				"right" => [
					"ферромагнетик",
					"магнитодиэлектрик"
				],
				"answers" => [
					"парамагнетик",
					"диамагнетик"
				]
			]),
			"question_id" => 37
		],
		[
			"answers" => json_encode([
				"right" => 
					"диамагнетик",

				"answers" => [
					"парамагнетик",
					"ферромагнетик",
					"магнитодиэлектрик"
				]
			]),
			"question_id" => 38
		],
		[
			"answers" => json_encode([
				"right" => 
					"парамагнетик",

				"answers" => [
					"диамагнетик",
					"ферромагнетик",
					"магнитодиэлектрик"
				]
			]),
			"question_id" => 39
		],
		[
			"answers" => json_encode([
				"right" => [
					"размагничивание",
					"намагничивание",
					"перемагничивание",
				],
				"answers" => [
					"насыщение",
				]
			]),
			"question_id" => 40
		],

		//////////////////////////////////////////////////////
		[
			"answers" => json_encode([
				"head" => [
					[
						"colspan" => 2,
						"text"=> "ферромагнитные материалы"
					],
					[
						"colspan" => 2,	
						"text"=> "петля Гистерезиса"
					],				
				],
				"rows" => [
					[
						1 => "1",
						"1file" => "petly1.png",
						3 => "А",
						2 => "магнитомягкий материал, электротехническая сталь"
					],
					[
						1 =>"2",
						"file2" => "petly2.png",
						3 =>"Б",
						2 =>"магнитомягкиий материал, пермалой"
					],
					[
						1 =>"3",
						"file3" => "petly3.png",
						3 =>"В",
						2 =>"магнитотвердый материал"
					],
				],
				"right" => [
					"312"
				],
				"answers" => [
					"head" => [
						[
							"colspan" => 1,
							"text"=> "А"
						],
						[
							"colspan" => 1,
							"text" => "Б"
						],
						[
							"colspan" => 1,
							"text"=> "В"
						]
					],
					"answers" => [
						[
							1,
							2,
							3
						]
						
					]
				]
			]),
			"question_id" => 41
		],
		[
			"answers" => json_encode([
				"head" => [
					[
						"colspan" => 2,
						"text"=> "Характеристики магнитного поля"
					],
					[
						"colspan" => 2,
						"text"=> "формулы"
					],				
				],
				"rows" => [
					[
						"А",
						"Во",
						"1",
						"коэрцитивная сила"
					],
					[
						"Б",
						"Нс",
						"2",
						"магнитная индукция насыщения"
					],
					[
						"В",
						"Вs",
						"3",
						"остаточная магнитная индукция"
					],
				],
				"right" => [
					"312"
				],
				"answers" => [
					"head" => [
						[
							"colspan" => 1,
							"text"=> "А"
						],
						[
							"colspan" => 1,
							"text" => "Б"
						],
						[
							"colspan" => 1,
							"text"=> "В"
						]
					],
					"answers" => [
						[
							1,
							2,
							3
						]
						
					]
				]
			]),
			"question_id" => 42
		],
		//////////////////////////////////////////////////////////////
		[
			"answers" => json_encode([
				"right" => 
					"по часовой стрелке",

				"answers" => [
					"против часовой стрелки",
					"равна нулю",
					"ничего из этого"
				]
			]),
			"question_id" => 43
		],
		[
			"answers" => json_encode([
				"right" => 
					"против часовой стрелки",

				"answers" => [
					"по часовой стрелке",
					"равна нулю",
					"ничего из этого"
				]
			]),
			"question_id" => 44
		],
		[
			"answers" => json_encode([
				"right" => 
					"против часовой стрелки",

				"answers" => [
					"по часовой стрелке",
					"равна нулю",
					"ничего из этого"
				]
			]),
			"question_id" => 45
		],
		[
			"answers" => json_encode([
				"right" => 
					"по часовой стрелке",

				"answers" => [
					"против часовой стрелки",
					"равна нулю",
					"ничего из этого"
				]
			]),
			"question_id" => 46
		],
		[
			"answers" => json_encode([
				"right" => 
					"явление электромагнитной индукции",

				"answers" => [
					"явление взаимоиндукции",
					"явление магнитострикции",
					"явление самоиндукции"
				]
			]),
			"question_id" => 47
		],
		[
			"answers" => json_encode([
				"right" => 
					"явление наведения электродвижущей силы в катушке при изменении тока в ней",

				"answers" => [
					"явление наведения электродвижущей силы в проводнике при пересечении им магнитных силовых линий",
					"явление наведения электродвижущей силы в одной из индуктивно связанных катушек при изменении тока в другой",
					"явление наведения электродвижущей силы в проводнике, если он находится в переменном магнитном поле"
				]
			]),
			"question_id" => 48
		],
		[
			"answers" => json_encode([
				"right" => 
					"e = - L · di/dt",

				"answers" => [
					"e = - B · l · v · sin α",
					"e = - M · di/dt",
					"e = M · di/dt",				
				]
			]),
			"question_id" => 49
		],
		[
			"answers" => json_encode([
				"right" => 
					"увеличится",

				"answers" => [
					"уменьшится",
					"не изменится",				
				]
			]),
			"question_id" => 50
		],
		[
			"answers" => json_encode([
				"right" => 
					"еi = 3cos1000t, B",

				"answers" => [
					"еi = 3sin1000t, B",
					"еi = 0,003cos1000t, B",
					"еi = 10cos1000t, B"				
				]
			]),
			"question_id" => 51
		],
		[
			"answers" => json_encode([
				"right" => 
					"явление самоиндукции",

				"answers" => [
					"явление электромагнитной индукции",
					"явление магнитострикции",
					"явление взаимоиндукции"				
				]
			]),
			"question_id" => 52
		],
		[
			"answers" => json_encode([
				"right" => 	
					"явление взаимоиндукции",

				"answers" => [
					"явление электромагнитной индукции",
					"явление магнитострикции",
					"явление самоиндукции",
				]
			]),
			"question_id" => 53
		],
		[
			"answers" => json_encode([
				"right" => 	
					"согласное включение катушек, L = 16 мГн",

				"answers" => [
					"встречное включение катушек, L = 10 мГн",
					"согласное включение катушек, L = 13 мГн",
					"встречное включение катушек, L =13 мГн",
				]
			]),
			"question_id" => 54
		],
		[
			"answers" => json_encode([
				"right" => 
					"встречное включение катушек, L = 10 мГн",	

				"answers" => [
					"согласное включение катушек, L = 16 мГн",
					"согласное включение катушек, L = 13 мГн",
					"встречное включение катушек, L = 13 мГн",
				]
			]),
			"question_id" => 55
		],
        ]);
    }
}
