<?php

namespace Database\Seeders;

use App\Models\Chapter;
use App\Models\Section;
use Database\Seeders\AnswerSeeder;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use \App\Models\User;
use Illuminate\Support\Facades\DB;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     *
     * @return void
     */
    public function run()
    {
        User::factory(1)->create([
            "is_admin" => true,
            "name" => "Влад",
            "login" => "admin",
            "email" => "rogatih2017@yandex.ru",
            "password" => "qwerty",
        ]);

        DB::table("chapters")->insert([
            [
                "name" => "Электромагнетизм",
                "sentence_doc" => 'chapterOne.htm',
            ],
            [
                "name" => "Электромагнитная индукция",
                "sentence_doc" => "chapterTwo.htm",
            ]
        ]);
        DB::table("sections")->insert([
            [
                "name" => "Магнитное поле тока",
                "document" => "1sgn2eX1rlFGOX3V92PJhV2SFdGnMn33s",
                "description" => 'Тест по теме "Магнитное поле тока" и правила правой руки',
                "idChapter" => 1
            ],
            [
                "name" => "Свойства магнитного поля",
                "document" => "1g3u2HzBpKxc99gSD7jL-ZQkpCmV7F02z",
                "description" => "Определение действия магнитного поля и его свойства",
                "idChapter" => 1
            ],
            [
                "name" => "Основные характеристики магнитного поля",
                "document" => "1WtvyHv35Z02Fa54JIV4rku948R0wSNuS",
                "description" => "Что такое напряженность, магнитная индукция, магнитный поток и потокосцепление",
                "idChapter" => 1
            ],
            [
                "name" => "Намагничивание и Перемагничивание ферромагнитных материалов",
                "document" => "1LSwW17bJECAriMrX1vleqGHHIMj8YcDR",
                "description" => "Магнитизм ферромагнитных материалов и петли гистерезиса",
                "idChapter" => 1
            ],
            [
                "name" => "Явление электромагнитной индукции",
                "document" => "1kV6Uur5j8bvftdpl0-UouUQQsD17u_o4",
                "description" => "Природа, эффект и возникновение ЭМИ",
                "idChapter" => 2
            ],
            [
                "name" => "Самоиндукция",
                "document" => "1OwiVO3y771aGSwcErbf2nyuBPGk_Z_P1",
                "description" => "Индуктивность и определние ЭДС",
                "idChapter" => 2
            ],
            [
                "name" => "Взаимоиндукция",
                "document" => "1e56Sh2hldnS8cGZ1SGn4Oj69_kfAL_c-",
                "description" => "Величины и направления взаимоиндукции",
                "idChapter" => 2
            ]
        ]);

        DB::table("type_questions")->insert([
            1 => [
                "name" => "Один ответ",
                "time" => 30,
            ],
            2 => [
                "name" => "Несколько ответов",
                "time" => 40,
            ],
            3 => [
                "name" => "Написать ответ",
                "time" => 60,
            ],
            4 => [
                "name" => "Сопоставить определния",
                "time" => 50,
            ],
        ]);
        DB::table("questions")->insert([
           1 => [
                "question" => "'Магнитным полем называется среда, в которой _________ силовое воздействие на движущие электрические заряды.'",
				"desc" => "'Впишите пропущенное слово (осуществляется, не осуществляется)'",
                "idTypeQuestion" => 3,
				"img" => "",
                "idSection" => 1
            ],
			2 => [
                "question" => "'Магнитное поле изображается с помощью магнитных силовых линий, которые всегда ___________.'",
				"desc" => "Впишите пропущенное слово (замкнуты, разамкнуты)",
				"img" => "",
                "idTypeQuestion" => 3,
                "idSection" => 1
            ],
            3 => [
                "question" => "Какое направление имеют магнитные силовые линии во внешнем и внутреннем магнитном поле?",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 1
            ],
            4 => [
                "question" => "Впишите пропущенное слово/словосочетание из предложенных ниже Направление магнитных силовых линий прямого провода с током определяется по правилу ________",
				"img" => "",
				"desc" => "(правого винта, Ампера, левой руки, правой руки)",
				"idTypeQuestion" => 3,
				"idSection" => 1
            ],
            5 => [
                "question" => "Правило для определения направления магнитных силовых линий прямого провода с током",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 1
            ],
            6 => [
                "question" => "Впишите пропущенное слово/словосочетание из предложенных ниже Направление магнитных силовых линий катушки с током определяется по правилу ________",
				"desc" => "(правого винта, Ампера, левой руки, правой руки)",
				"img" => "",
                "idTypeQuestion" => 3,
                "idSection" => 1
            ],
            7 => [
                "question" => "Правило для определения направления магнитных силовых линий катушки с током",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 2,
                "idSection" => 1
            ],  
			8 => [
                "question" => "Выберите верное направление магнитных силовых линий",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 2,
                "idSection" => 1
            ],
			9 => [
                "question" => "Выберите верное направление магнитных силовых линий",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 2,
                "idSection" => 1
            ],
			10 => [
                "question" => "Выберите верное направление магнитных силовых линий",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 1
            ],
			11 => [
                "question" => "Выберите верное направление магнитных силовых линий катушки с током",
				"desc" => "",
				"img" => "circleObvod1.png",
                "idTypeQuestion" => 1,
                "idSection" => 1
            ],
			12 => [
                "question" => "Выберите верное направление магнитных силовых линий катушки с током",
				"desc" => "",
				"img" => "circleObvod2.png",
                "idTypeQuestion" => 1,
                "idSection" => 1
            ],
			13 => [
                "question" => "Выберите верное направление магнитных силовых линий катушки с током",
				"desc" => "",
				"img" => "circleObvod3.png",
                "idTypeQuestion" => 1,
                "idSection" => 1
            ],
			14 => [
                "question" => "Впишите пропущенное слово Магнитное поле способно намагничивать __________ материалы.",
				"desc" => "Из предложенных (парамагнитные, диамагнитные, ферромагнитные)",
				"img" => "",
                "idTypeQuestion" => 3,
                "idSection" => 2
            ],
			15 => [
                "question" => "Каково взаимодействие  постоянных магнитов?",
				"desc" => "",
				"img" => "magnits1.png",
                "idTypeQuestion" => 1,
                "idSection" => 2
            ],
			16 => [
                "question" => "Каково взаимодействие  постоянных магнитов?",
				"desc" => "",
				"img" => "magnits2.png",
                "idTypeQuestion" => 1,
                "idSection" => 2
            ],
			17 => [
                "question" => "Какое свойство магнитного поля отображает рисунок?",
				"desc" => "",
				"img" => "dugi.png",
                "idTypeQuestion" => 1,
                "idSection" => 2
            ],
			18 => [
                "question" => "Что является причиной возникновения индукционного тока?",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 2
            ],
			19 => [
                "question" => "Способность изменять линейные размеры некоторых магнитных материалов при их намагничивании. О каком явлении идет речь?",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 2
            ],	
			20 => [
                "question" => "7.	Явление наведения ЭДС в проводнике, находящемся в переменном магнитном поле. О каком явлении идет речь?",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 2
            ],
			21 => [
                "question" => "Явление наведения ЭДС в катушке при изменении тока в ней. О каком явлении идет речь?",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 2
            ],
			22 => [
                "question" => "Явление наведения ЭДС индукции в одной из индуктивно связанных катушек при изменении тока в другой. О каком явлении идет речь?",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 2
            ],

			23 => [
                "question" => "Cиловая характеристика магнитного поля, созданного током без учета влияния среды – это",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 3
            ],
			24 => [
                "question" => "Силовая характеристика магнитного поля, созданного током с учетом влияния среды
				",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 3
            ],
			25 => [
                "question" => "Абсолютная магнитная проницаемость материала μ>>1. К какой группе относится этот материал?",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 3
            ],
			26 => [
                "question" => "Напряженность магнитного поля - _________ характеристика магнитного поля, созданного током  __________   влияния среды.",
				"desc" => "Впишите пропущенные слова через запятую без пробела (силовая, энергетическая, без учета, с учетом)",
				"img" => "",
                "idTypeQuestion" => 3,
                "idSection" => 3
            ],
			27 => [
                "question" => "В прямом проводе I = 2А.",
				"desc" => "Рассчитать напряженность в точке А, отстоящей от оси провода на расстоянии а=3см.",
				"img" => "roundCircle1.png",
                "idTypeQuestion" => 1,
                "idSection" => 3
            ],
			28 => [
                "question" => "В прямом проводе I = 2А.",
				"desc" => "Рассчитать индукцию в точке А, отстоящей от оси провода на расстоянии а=3см.",
				"img" => "roundCircle1.png",
                "idTypeQuestion" => 1,
                "idSection" => 3
            ],
			29 => [
                "question" => "Рассчитать магнитный поток в катушке, если В = 0,9Тл, S = 5см^2.",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 3
            ],
			30 => [
                "question" => "Определить потокосцепление катушки с магнитным потоком, если В = 1,2Тл, S = 5см^2, число витков – 150.",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 3
            ],
			
			31 => [
                "question" => "Установите соответствие между физическими величинами, формулами, по которым их можно рассчитать и единицами измерений физических величин.",
				"desc" => "В каждой позиции первого столбца подберите соответствующую позицию из второго и третьего столбца и запишите в таблицу выбранные буквы под соответствующим цифрами.",
				"img" => "",
                "idTypeQuestion" => 4,
                "idSection" => 3
            ],
			32 => [
                "question" => "Определить напряженность кольцевой катушки по графику, если В=1,2Тл, средняя длина 5см, число витков 200.",
				"desc" => "",
				"img" => "grafic1.png",
                "idTypeQuestion" => 1,
                "idSection" => 3
            ],
			33 => [
                "question" => "Определить ток в кольцевой катушке, если Н = 80 A/м, средняя длина 5 см, число витков 200.",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 3
            ],
			34 => [
                "question" => "Определить общую намагничивающую силу, если число витков 1 обмотки – 100, I1=1А, I2=0,5А.",
				"desc" => "",
				"img" => "cep.gif",
                "idTypeQuestion" => 1,
                "idSection" => 3
            ],


			35 => [
                "question" => "Домены (области спонтанного намагничивания) – это ",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 4
            ],
			36 => [
                "question" => "Выберите верное утверждение для групп ферромагнетиков",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 2,
                "idSection" => 4
            ],
			37 => [
                "question" => "Абсолютная магнитная проницаемость материала μ>>1. К какой группе относится этот материал?",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 2,
                "idSection" => 4
            ],
			38 => [
                "question" => "Абсолютная магнитная проницаемость материала μ>1. К какой группе относится этот материал?",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 4
            ],
			39 => [
                "question" => "Абсолютная магнитная проницаемость материала μ<<1. К какой группе относится этот материал?",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 4
            ],
			40 => [
                "question" => "О каких процессах ферромагнитного материала, изображенных на рисунке, идет речь?",
				"desc" => "",
				"img" => "petly.gif",
                "idTypeQuestion" => 2,
                "idSection" => 4
            ],
			41 => [
                "question" => "Установите соответствие между петлей Гистерезиса и различных ферромагнитных материалов. В каждой позиции первого столбца подберите соответствующую позицию из второго столбца и запишите в таблицу выбранные буквы под соответствующим цифрами.
				",
				"desc" => "В каждой позиции первого столбца подберите соответствующую позицию из второго столбца и запишите в таблицу выбранные буквы под соответствующим цифрами.",
				"img" => "",
                "idTypeQuestion" => 4,
                "idSection" => 4
            ],
			42 => [
                "question" => "В каждой позиции первого столбца подберите соответствующую позицию из второго столбца и запишите в таблицу выбранные буквы под соответствующим цифрами.",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 4,
                "idSection" => 4
            ],
			43 => [
                "question" => "Определить направление ЭДС в контуре, если магнитный поток увеличивается? ",
				"desc" => "Запишите ответ из предложенных(по часовой стрелке,  против часовой стрелки, равна нулю)",
				"img" => "eds1.png",
                "idTypeQuestion" => 3,
                "idSection" => 5
            ],
			44 => [
                "question" => "Определить направление ЭДС в контуре, если магнитный поток уменьшается?",
				"desc" => "Запишите ответ из предложенных(по часовой стрелке,  против часовой стрелки, равна нулю)",
				"img" => "eds1.png",
                "idTypeQuestion" => 3,
                "idSection" => 5
            ],
			45 => [
                "question" => "Определить направление ЭДС в кольце при удалении магнита от кольца.",
				"desc" => "Запишите ответ из предложенных(по часовой стрелке,  против часовой стрелки, равна нулю)",
				"img" => "eds2.png",
                "idTypeQuestion" => 3,
                "idSection" => 5
            ],
			46 => [
                "question" => "Определить направление ЭДС в кольце при приближении магнита к кольцу.",
				"desc" => "Запишите ответ из предложенных(по часовой стрелке,  против часовой стрелки, равна нулю)",
				"img" => "eds2.png",
                "idTypeQuestion" => 3,
                "idSection" => 5
            ],
			47 => [
                "question" => "Явление наведения ЭДС в проводнике, находящемся в переменном магнитном поле. О каком явлении идет речь?",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 5
            ],
			48 => [
                "question" => "Самоиндукция – это:",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 6
            ],
			49 => [
                "question" => "Формула для расчёта ЭДС самоиндукции",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 6
            ],
			50 => [
                "question" => "Как изменится величина индуктивности катушки, если в неё внести ферромагнитный сердечник?",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 6
            ],
			51 => [
                "question" => "Определить ЭДС в катушке, если L=10 мГн i=0.3sin1000t, A",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 6
            ],
			52 => [
                "question" => "Явление наведения ЭДС в катушке при изменении тока в ней. О каком явлении идет речь?",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 6
            ],
			53 => [
                "question" => "Явление наведения ЭДС индукции в одной из индуктивно связанных катушек при изменении тока в другой. О каком явлении идет речь?",
				"desc" => "",
				"img" => "",
                "idTypeQuestion" => 1,
                "idSection" => 7
            ],
			54 => [
                "question" => "Определить способ соединения катушек и рассчитать индуктивность цепи, если L1=4мГн, L2=9мГн, k=0,5.",
				"desc" => "",
				"img" => "catush1.png",
                "idTypeQuestion" => 1,
                "idSection" => 7
            ],
			55 => [
                "question" => "Определить способ соединения катушек и рассчитать индуктивность цепи, если L1=4мГн, L2=9мГн, k=0,5.",
				"desc" => "",
				"img" => "catush2.png",
                "idTypeQuestion" => 1,
                "idSection" => 7
            ],
        ]);
		$this->call([
			AnswerSeeder::class
		]);
    }
}
